using System;
using Microsoft.VisualStudio.TestTools.UnitTesting;
using Heima8.OA.EFDAL;
namespace Heima8.OA.UnitTest
{
    [TestClass]
    public class UnitTest1
    {
        [TestMethod]
        public void TestMethod1()
        {
            /////////////////////////////////////////////////////////
            //测试嵌入                      ---------------------------
            //                              ---------------------------
            //小马 大马  老马               ---------------------------
            //老马 讲讲  html               ---------------------------
            //                              ---------------------------
            //-------------------------------------------------

            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///
            //我那个去。。。。。。。。。。。。。。！！！！！！！！///

            UserInfoDal dal = new UserInfoDal();
            Console.WriteLine(dal.GetEntities(u => true)) ;
            Console.ReadLine();
        }
    }
}
